#pragma once
#include "DxLib.h"
/********************************************************
●概要
　Dxライブラリのカラー関数の入力を簡易化することで
  デバッグを楽にすることを想定しています。
********************************************************/

/********************************************************
RGB色 一覧
命名規則：色の略語2文字
********************************************************/
#define WH	GetColor(255,255,255)	// 白
#define BK	GetColor(0,0,0)			// 黒
#define RD	GetColor(255,0,0)		// 赤
#define GR	GetColor(0,255,0)		// 緑
#define BL	GetColor(0,0,255)		// 青